posts/lxc/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LXC | DevOps Brain Dump</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://skinney6.github.io/posts/lxc/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Scott Kinney">
<meta property="og:site_name" content="DevOps Brain Dump">
<meta property="og:title" content="LXC">
<meta property="og:url" content="http://skinney6.github.io/posts/lxc/">
<meta property="og:description" content="Installation: lxd blog on installation


Configuration


Network


New bridge where host and containers on the same subnet

Create a new bridge on the host and enslave the hosts primary nic to it.
Edi">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-12-28T14:40:50-08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://skinney6.github.io/">

                <span id="blog-title">DevOps Brain Dump</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">LXC</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Scott Kinney
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-12-28T14:40:50-08:00" itemprop="datePublished" title="2017-12-28 14:40">2017-12-28 14:40</time></a></p>
                <p class="commentline">
        


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Installation: <a href="http://insights.ubuntu.com/2016/03/16/lxd-2-0-installing-and-configuring-lxd-212/">lxd blog on installation</a>
</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Configuration</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Network</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">New bridge where host and containers on the same subnet</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ul class="org-ul">
<li>
<a id="sec-2-1-1-1" name="sec-2-1-1-1"></a>Create a new bridge on the host and enslave the hosts primary nic to it.<br>
</li>
<li>
<a id="sec-2-1-1-2" name="sec-2-1-1-2"></a>Edit <code>/etc/network/interfaces</code>. Comment out the primary nic block and add…<br><div class="outline-text-5" id="text-2-1-1-2">
<div class="highlight"><pre><span></span>auto br0
iface br0 inet dhcp
   bridge_ports &lt;nic&gt;
   bridge_stp off
   bridge_fd 0
   bridge_maxwait 0
</pre></div>
</div>
</li>
<li>
<a id="sec-2-1-1-3" name="sec-2-1-1-3"></a>Reboot<br>
</li>
<li>
<a id="sec-2-1-1-4" name="sec-2-1-1-4"></a>Add a profile and use the new bridge (br0) instead of lxdbr0<br>
</li>
<li>
<a id="sec-2-1-1-5" name="sec-2-1-1-5"></a>Or edit the default profile to use br0<br>
</li>
<li>
<a id="sec-2-1-1-6" name="sec-2-1-1-6"></a>Containers will now join the lan the host is on, get ip via dhcp and dns resolution (if enabled).<br>
</li>
</ul>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">lxdbr0 on it's own subnet with NAT</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ul class="org-ul">
<li>
<a id="sec-2-1-2-1" name="sec-2-1-2-1"></a>Assign ipv4 address<br>
</li>
<li>
<a id="sec-2-1-2-2" name="sec-2-1-2-2"></a>Edit <code>/etc/default/lxd-bridge</code>, see the comments for address, subnet mask and dhcp ranges etc.<br>
</li>
<li>
<a id="sec-2-1-2-3" name="sec-2-1-2-3"></a>Restart the lxd-bridge (and dnsmasq)<br><div class="outline-text-5" id="text-2-1-2-3">
<div class="highlight"><pre><span></span>/usr/lib/lxd/lxd-bridge restart
</pre></div>
</div>
</li>
<li>
<a id="sec-2-1-2-4" name="sec-2-1-2-4"></a>local dns resolution with dnsmasq<br>
</li>
<li>
<a id="sec-2-1-2-5" name="sec-2-1-2-5"></a>Copy the lxc dnsmasq conf<br><div class="outline-text-5" id="text-2-1-2-5">
<div class="highlight"><pre><span></span>cp /etc/dnsmasq.d-available/lxc /etc/dnsmasq.d-available/lxd
</pre></div>
</div>
</li>
<li>
<a id="sec-2-1-2-6" name="sec-2-1-2-6"></a>In <code>/etc/dnsmasq.d-available/lxd</code><br><ul class="org-ul">
<li>
<a id="sec-2-1-2-6-1" name="sec-2-1-2-6-1"></a>change the bridge from <code>lxcbr0</code> to <code>lxdbr0</code>:<br>
</li>
<li>
<a id="sec-2-1-2-6-2" name="sec-2-1-2-6-2"></a>Add <code>strict-order</code><br>
</li>
<li>
<a id="sec-2-1-2-6-3" name="sec-2-1-2-6-3"></a>Symlink<br><div class="outline-text-6" id="text-2-1-2-6-3">
<div class="highlight"><pre><span></span>ln -s /etc/dnsmasq.d-available/lxd /etc/dnsmasq.d/lxd
</pre></div>
</div>
</li>
</ul>
</li>
<li>
<a id="sec-2-1-2-7" name="sec-2-1-2-7"></a>Add <code>nameserver &lt;lxdbr0 ip&gt;</code> as the first entry in <code>/etc/resolv.conf</code><br>
</li>
<li>
<a id="sec-2-1-2-8" name="sec-2-1-2-8"></a>Restart the lxd-bridge (and dnsmasq)<br><div class="outline-text-5" id="text-2-1-2-8">
<div class="highlight"><pre><span></span>/usr/lib/lxd/lxd-bridge restart
</pre></div>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">SSH access to a container</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Launch a container from an official ubuntu image</h3>
<div class="outline-text-3" id="text-3-1">
<div class="highlight"><pre><span></span>lxc launch ubuntu:xenial xenial1
</pre></div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Create a key pair</h3>
<div class="outline-text-3" id="text-3-2">
<div class="highlight"><pre><span></span>ssh-keygen -t rsa -b 2048 -C lxchost_container_key -f ~/.ssh/lxc_host_container_key
</pre></div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Copy the public key to the container so we can ssh into said container</h3>
<div class="outline-text-3" id="text-3-3">
<div class="highlight"><pre><span></span>lxc file push lxc_host_container_key.pub &lt;container name&gt;/home/ubuntu/.ssh/authorized_keys
</pre></div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Change ownership of the authorized<sub>keys</sub> file</h3>
<div class="outline-text-3" id="text-3-4">
<div class="highlight"><pre><span></span>lxc exec &lt;container name&gt; "chown ubuntu: /home/ubuntu/.ssh/authorized_keys"
</pre></div>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">SSH into the container</h3>
<div class="outline-text-3" id="text-3-5">
<div class="highlight"><pre><span></span>ssh ubuntu@xenial1 -i lxc_host_container_key
</pre></div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Some common commands</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Launch an container from an official ubuntu image</h3>
<div class="outline-text-3" id="text-4-1">
<div class="highlight"><pre><span></span>lxc launch ubuntu:trusty &lt;container name&gt;
</pre></div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Get a bash prompt in the container</h3>
<div class="outline-text-3" id="text-4-2">
<div class="highlight"><pre><span></span>lxc exec &lt;container name&gt; bash
</pre></div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Mount a host directory in the container (absolute paths)</h3>
<div class="outline-text-3" id="text-4-3">
<div class="highlight"><pre><span></span>lxc config device add &lt;container name&gt; mount1 disk source=/home/scott/xenial1_mount/ path=mount1
</pre></div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">Create an alias for an image</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1">Get the image fingerprint</h4>
<div class="outline-text-4" id="text-4-4-1">
<div class="highlight"><pre><span></span>lxc image list
</pre></div>
</div>
</div>
<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2">Create the alias</h4>
<div class="outline-text-4" id="text-4-4-2">
<div class="highlight"><pre><span></span>lxc image alias create xenial 4c4c60a6b75
</pre></div>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5">Snapshots</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1">Snapshot a container</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="highlight"><pre><span></span>lxc snapshot &lt;container name&gt; &lt;snapshot name&gt;
</pre></div>
</div>
</div>
<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2">Restore a container to a snapshot</h4>
<div class="outline-text-4" id="text-4-5-2">
<div class="highlight"><pre><span></span>lxc restore &lt;container name&gt; &lt;snapshot name&gt;
</pre></div>
</div>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6">Cloning and renaming</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-sec-4-6-1" class="outline-4">
<h4 id="sec-4-6-1">Copy a container</h4>
<div class="outline-text-4" id="text-4-6-1">
<div class="highlight"><pre><span></span>lxc copy &lt;src container name&gt; &lt;dest container name&gt;
</pre></div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Create virtual network from scratch (might need this to run lxd on Arch)</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Create the <code>lxdbr0</code> software bridge</h3>
<div class="outline-text-3" id="text-5-1">
<div class="highlight"><pre><span></span>ip li add lxdbr0 type bridge
</pre></div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Configuration documentation <a href="https://github.com/lxc/lxd/blob/master/doc/configuration.md">here</a>
</h2>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside><section class="comments hidden-print"><h2>Comments</h2>
        
        


        </section></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:skinney6@gmail.com">Scott Kinney</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
